user-files/taurus-grar.yml
modules:
  gatling:
    version: 3.2.1

execution:
- executor: gatling
  scenario: Municipality-Standard
  concurrency: 1
  iterations: 1
  hold-for: 1h
  ramp-up: 30m
  locations:
    eu-west-1: 2

scenarios:
  Municipality-Standard:
    script: MunicipalitySimulation.scala
    simulation: StandardTrafficLoadForMunicipality
    properties:
      api_key: xxx
      base_url: https://api.basisregisters.dev-vlaanderen.be/v1
      warmup_url: https://api.basisregisters.dev-vlaanderen.be/v1/versions